app/Controllers/Dompet.php

SELECT *
FROM `tb_gaji`
---
    public function __construct()
    {
        $this->penghitungpModel = new PenghitungpModel();
        $this->penggunaanModel = new PenggunaanlModel();
        $this->rencanaModel = new RencanaModel();
        $this->todoModel = new TodolistModel();
        $this->gajiModel = new GajiModel();
        $this->riwayatgajiModel = new RiwayatgajiModel();
        $this->piutangModel = new PiutangModel();
        $this->cicilanModel = new CicilanModel();
        $this->dompetModel = new DompetModel();


        $lowerCase = "abcdefghijklmnopqrstuvwxyz";
        $upperCase = "ABCDEFGHIJKLMNOPQRSTUVWXYZ";
        $numbers = "1234567890";
        $symbols = "!@#$%^&*()_+=-.";

        $lowerCase = str_shuffle($lowerCase);
        $upperCase = str_shuffle($upperCase);
        $numbers = str_shuffle($numbers);
        $symbols = str_shuffle($symbols);
        $randomPassword = substr($lowerCase, 0, 4);
        $randomPassword .= substr($upperCase, 0, 4);
        $randomPassword .= substr($numbers, 0, 4);
        $randomPassword .= substr($symbols, 0, 4);
        $password = str_shuffle($randomPassword);
        $datagaji = $this->gajiModel->findAll();

SELECT *
FROM `tb_piutang`
SELECT *
FROM `tb_gaji`
---
    public function index()
    {
        $dompetModel = new DompetModel();
        $kebutuhanModel = new KebutuhanModel();
        $targetModel = new TargetModel();
        $logModel = new LogaktivitasModel();

        $lowerCase = "abcdefghijklmnopqrstuvwxyz";
        $upperCase = "ABCDEFGHIJKLMNOPQRSTUVWXYZ";
        $numbers = "1234567890";
        $symbols = "!@#$%^&*()_+=-.";

        $lowerCase = str_shuffle($lowerCase);
        $upperCase = str_shuffle($upperCase);
        $numbers = str_shuffle($numbers);
        $symbols = str_shuffle($symbols);
        $randomPassword = substr($lowerCase, 0, 4);
        $randomPassword .= substr($upperCase, 0, 4);
        $randomPassword
        .= substr($numbers, 0, 4);
        $randomPassword .= substr($symbols, 0, 4);
        $password = str_shuffle($randomPassword);

        $data = [
            'title' => 'Dompet',
            'datadompet' => $dompetModel->getAllDompet(user_id()),
            'datakebutuhan' => $kebutuhanModel->getLimitKebutuhan(user_id()),
            'datatarget' => $targetModel->getLimitTarget(user_id()),
            'keluartotal' => $logModel->getAllLog(user_id()),
            'datalog' => $logModel->getLogBulan(user_id()),
            'sumsaldo' => $logModel->getSumAll(user_id()),
            'datatrf' => $logModel->getJmlTrf(user_id()),
            'logbulan' => $logModel->getLogBulanIni(user_id()),
            'loghariini' => $logModel->getLogHariIni(user_id()),
            'datapenghitung' => $this->penghitungpModel->getAllPenghitungUser(user_id()),
            'datapenggunaan' => $this->penggunaanModel->getAllPenggunaanUser(user_id()),
            'datarencana' => $this->rencanaModel->getRencanaUser(user_id()),
            'datatodolist' => $this->todoModel->getToDoUser(user_id()),
            'datagaji' => $this->gajiModel->findAll(),
            'datapiutang' => $this->piutangModel->getPiutangUser(user_id()),
            'datacicilan' => $this->cicilanModel->getCicilanUser(user_id()),
            'jmltrxblnini' => $logModel->getJmlTrxBlnIni(user_id()),
            'generate' => $password,
            'random' => $randomPassword,
            'iduser' => user_id(),
        ];