app/Controllers/Kategori.php

    public function index()
    {
        $data = [
            'title' => 'Kategori',
            'datakategori' => $this->kategoriModel->findAll()
---
SELECT *
FROM `tb_kategori`

    public function addproses()
    {
        $data = array(
            'kategori' => htmlspecialchars($this->request->getPost('kategori')),
            'icon' => $this->request->getPost('icon'),
            'slug' => uniqid($this->code()['password'], $this->code()['randomPassword']),'id_user' => user_id()
        );
        $this->kategoriModel->save($data);
---
INSERT INTO `tb_kategori` (`kategori`, `icon`, `created_at`, `updated_at`) VALUES ('Listrik', 'fa-solid fa-bolt', '2024-07-02 12:38:49', '2024-07-02 12:38:49')