app/Controllers/Logaktivitas.php

SELECT *
FROM `tb_gaji`
---
    public function logFilter($tanggal1 = 'Y-m-d', $tanggal2 = 'Y-m-d')
    {
        $data = [
            'title' => 'Log Detail',
            'datalog' => $this->logModel->filterData($tanggal1, $tanggal2),
            'datadompet' => $this->dompetModel->getAllDompet(user_id()),
            'datagaji' => $this->gajiModel->findAll()