app/Controllers/Logaktivitas.php

    public function logFilter($tanggal1 = 'Y-m-d', $tanggal2 = 'Y-m-d')
    {
        $data = [
            'datalog' => $this->logModel->filterData($tanggal1, $tanggal2),
            'datadompet' => $this->dompetModel->getAllDompet(),
            'datagaji' => $this->gajiModel->findAll()
---
SELECT *
FROM `tb_gaji`