app/Controllers/Piutang.php

SELECT *
FROM `tb_piutang`
WHERE `tb_piutang`.`id` = '7'
---
    public function orangutang($id){
        return $this->response->setJSON([
            'piutang' => $this->piutangModel->find($id)
        ]);