app/Models/DompetModel.php

SELECT *
FROM `tb_dompet`
WHERE `tb_dompet`.`id_user` = '3'
---
    public function getAllDompet($user_id)
    {
        if($user_id){
            return $this->db->table($this->table)
            // ->join('users','users.id=tb_dompet.id_user')
            ->where('tb_dompet.id_user', $user_id)
            ->get()
            ->getResultArray();
        }else{
            return $this->findAll();