app/Models/KebutuhanModel.php

SELECT *
FROM `tb_kebutuhan`
WHERE `id_user` = '3'
 LIMIT 5
---
    public function getLimitKebutuhan($user_id)
    {
        return $this->db->table($this->table)
            ->where('id_user', $user_id)
            ->limit(5)
            ->get()->getResultArray();