app/Models/KebutuhanModel.php

    public function getLimitKebutuhan()
    {
        return $this->db->table($this->table)
            ->limit(5)
            ->get()->getResultArray();
---
SELECT *
FROM `tb_kebutuhan`
 LIMIT 5