app/Models/LogaktivitasModel.php

SELECT `id`, `tb_logaktivitas`.`log_aktivitas`, `jumlah`, `tanggal`, `catatan`, `tb_logaktivitas`.`status`, `tb_logaktivitas`.`id_dompet`, `nama_dompet`, `saldo`, `saldo_awal`
FROM `tb_logaktivitas`
JOIN `tb_dompet` ON `tb_dompet`.`id_dompet`=`tb_logaktivitas`.`id_dompet`
WHERE `tb_logaktivitas`.`id_user` = '3'
ORDER BY `tanggal` DESC, `id` DESC
---
    public function getAllLog($user_id)
    {
        return $this->db->table($this->table)
            ->select('id, tb_logaktivitas.log_aktivitas,jumlah,tanggal,catatan, tb_logaktivitas.status, tb_logaktivitas.id_dompet, nama_dompet, saldo, saldo_awal')
            ->join('tb_dompet', 'tb_dompet.id_dompet=tb_logaktivitas.id_dompet')
            ->where('tb_logaktivitas.id_user', $user_id)
            ->orderBy('tanggal', 'DESC')
            ->orderBy('id', 'DESC')
            ->get()
            ->getResultArray();

SELECT `tb_dompet`.`nama_dompet`, `tb_logaktivitas`.`ke_iddompet`, SUM(`jumlah`) AS `jumlah`
FROM `tb_logaktivitas`
JOIN `tb_dompet` ON `tb_dompet`.`id_dompet`=`tb_logaktivitas`.`id_dompet`
WHERE `tb_logaktivitas`.`id_user` = '3'
GROUP BY `tb_logaktivitas`.`id_dompet`
---
    public function getSumAll($user_id)
    {
        return $this->db->table($this->table)
            ->select('tb_dompet.nama_dompet, tb_logaktivitas.ke_iddompet')
            ->selectSum('jumlah')
            ->join('tb_dompet', 'tb_dompet.id_dompet=tb_logaktivitas.id_dompet')
            ->where('tb_logaktivitas.id_user', $user_id)
            ->groupBy('tb_logaktivitas.id_dompet')
            ->get()
            ->getResultArray();

SELECT `id`, `tb_logaktivitas`.`log_aktivitas`, `jumlah`, `tanggal`, `catatan`, `tb_logaktivitas`.`status`, `tb_logaktivitas`.`id_dompet`, `nama_dompet`, `saldo`, `saldo_awal`, `ke_iddompet`
FROM `tb_logaktivitas`
JOIN `tb_dompet` ON `tb_dompet`.`id_dompet`=`tb_logaktivitas`.`id_dompet`
WHERE `tb_logaktivitas`.`id_user` = '3'
AND `tanggal` >= '2024-03-01'
AND `tanggal` <= '2024-03-31'
---
    public function getLogBulanIni($user_id)
    {
        return $this->db->table($this->table)
            ->select('id, tb_logaktivitas.log_aktivitas,jumlah,tanggal,catatan, tb_logaktivitas.status, tb_logaktivitas.id_dompet, nama_dompet, saldo, saldo_awal, ke_iddompet')
            ->join('tb_dompet', 'tb_dompet.id_dompet=tb_logaktivitas.id_dompet')
            ->where('tb_logaktivitas.id_user', $user_id)
            ->where('tanggal >=', date('Y-m-01'))
            ->where('tanggal <=', date('Y-m-31'))
            ->get()
            ->getResultArray();

SELECT `id`, `tb_logaktivitas`.`log_aktivitas`, `jumlah`, `tanggal`, `catatan`, `tb_logaktivitas`.`status`, `tb_logaktivitas`.`id_dompet`, `nama_dompet`, `saldo`, `saldo_awal`, `ke_iddompet`
FROM `tb_logaktivitas`
JOIN `tb_dompet` ON `tb_dompet`.`id_dompet`=`tb_logaktivitas`.`id_dompet`
WHERE `tb_logaktivitas`.`id_user` = '3'
AND `tanggal` = '2024-03-27'
---
    public function getLogHariIni($user_id)
    {
        return $this->db->table($this->table)
            ->select('id, tb_logaktivitas.log_aktivitas,jumlah,tanggal,catatan, tb_logaktivitas.status, tb_logaktivitas.id_dompet, nama_dompet, saldo, saldo_awal, ke_iddompet')
            ->join('tb_dompet', 'tb_dompet.id_dompet=tb_logaktivitas.id_dompet')
            ->where('tb_logaktivitas.id_user', $user_id)
            ->where('tanggal', date('Y-m-d'))
            ->get()
            ->getResultArray();

SELECT `id`, `tb_logaktivitas`.`log_aktivitas`, `jumlah`, `tanggal`, `catatan`, `tb_logaktivitas`.`status`, `tb_logaktivitas`.`id_dompet`, `nama_dompet`, `saldo`, `saldo_awal`, `ke_iddompet`
FROM `tb_logaktivitas`
JOIN `tb_dompet` ON `tb_dompet`.`id_dompet`=`tb_logaktivitas`.`id_dompet`
WHERE `tanggal` >= '2024-03-01'
AND `tanggal` <= '2024-03-31'
AND `tb_logaktivitas`.`id_user` = '3'
ORDER BY `tanggal` DESC, `id` DESC
---
    public function getLogBulan($user_id)
    {
        return $this->db->table($this->table)
            ->select('id, tb_logaktivitas.log_aktivitas,jumlah,tanggal,catatan, tb_logaktivitas.status, tb_logaktivitas.id_dompet, nama_dompet, saldo, saldo_awal, ke_iddompet')
            ->join('tb_dompet', 'tb_dompet.id_dompet=tb_logaktivitas.id_dompet')
            ->where('tanggal >=', date('Y-m-01'))
            ->where('tanggal <=', date('Y-m-31'))
            ->where('tb_logaktivitas.id_user', $user_id)
            ->orderBy('tanggal', 'DESC')
            ->orderBy('id', 'DESC')
            ->get()
            ->getResultArray();

SELECT *
FROM `tb_logaktivitas`
JOIN `tb_dompet` ON `tb_dompet`.`id_dompet`=`tb_logaktivitas`.`id_dompet`
WHERE `tb_logaktivitas`.`id_user` = '3'
AND `tanggal` >= '2024-03-01'
AND `tanggal` <= '2024-03-31'
---
    public function getJmlTrxBlnIni($user_id)
    {
        return $this->db->table($this->table)
            ->join('tb_dompet', 'tb_dompet.id_dompet=tb_logaktivitas.id_dompet')
            ->where('tb_logaktivitas.id_user', $user_id)
            ->where('tanggal >=', date('Y-m-01'))
            ->where('tanggal <=', date('Y-m-31'))
            ->get()
            ->getNumRows();

SELECT `id`, `tb_logaktivitas`.`log_aktivitas`, `jumlah`, `tanggal`, `catatan`, `tb_logaktivitas`.`status`, `tb_logaktivitas`.`id_dompet`, `nama_dompet`, `saldo`, `saldo_awal`
FROM `tb_logaktivitas`
JOIN `tb_dompet` ON `tb_dompet`.`id_dompet`=`tb_logaktivitas`.`id_dompet`
WHERE `tb_logaktivitas`.`id_user` = '3'
AND `tb_logaktivitas`.`status` = 2
---
    public function getJmlTrf($user_id)
    {
        return $this->db->table($this->table)
            ->select('id, tb_logaktivitas.log_aktivitas,jumlah,tanggal,catatan, tb_logaktivitas.status, tb_logaktivitas.id_dompet, nama_dompet, saldo, saldo_awal')
            ->join('tb_dompet', 'tb_dompet.id_dompet=tb_logaktivitas.id_dompet')
            ->where('tb_logaktivitas.id_user', $user_id)
            ->where('tb_logaktivitas.status', 2)
            ->get()
            ->getResultArray();

SELECT `id`, `tb_logaktivitas`.`log_aktivitas`, `jumlah`, `tanggal`, `catatan`, `tb_logaktivitas`.`status`, `tb_logaktivitas`.`id_dompet`, `nama_dompet`, `saldo`, `saldo_awal`, `ke_iddompet`, `tb_logaktivitas`.`id_user`
FROM `tb_logaktivitas`
JOIN `tb_dompet` ON `tb_dompet`.`id_dompet`=`tb_logaktivitas`.`id_dompet`
WHERE `tb_logaktivitas`.`id_user` = '3'
AND `tanggal` >= '2024-02-27'
AND `tanggal` <= '2024-03-27'
ORDER BY `tanggal` DESC, `id` DESC
---
    public function filterData($tanggal1 = 'Y-m-01', $tanggal2 = 'Y-m-31')
    {
        return $this->db->table($this->table)
            ->select('id, tb_logaktivitas.log_aktivitas,jumlah,tanggal,catatan, tb_logaktivitas.status, tb_logaktivitas.id_dompet, nama_dompet, saldo, saldo_awal, ke_iddompet, tb_logaktivitas.id_user')
            ->join('tb_dompet', 'tb_dompet.id_dompet=tb_logaktivitas.id_dompet')
            ->where('tb_logaktivitas.id_user', user_id())
            ->where('tanggal >=', date($tanggal1))
            ->where('tanggal <=', date($tanggal2))
            ->orderBy('tanggal', 'DESC')
            ->orderBy('id', 'DESC')
            ->get()
            ->getResultArray();