app/Models/PiutangModel.php

SELECT *
FROM `tb_piutang`
JOIN `tb_dompet` ON `tb_dompet`.`id_dompet`=`tb_piutang`.`id_dompet`
WHERE `id` = '7'
 LIMIT 1
---
    public function getPiutang($slug = false)
    {
        if ($slug == false) {
            return $this->join('tb_dompet', 'tb_dompet.id_dompet=tb_piutang.id_dompet')->orderBy('tanggal_pinjam', 'DESC')->findAll();
        }

        return $this->join('tb_dompet', 'tb_dompet.id_dompet=tb_piutang.id_dompet')->where(['id' => $slug])->first();

SELECT *
FROM `tb_piutang`
JOIN `tb_dompet` ON `tb_dompet`.`id_dompet`=`tb_piutang`.`id_dompet`
WHERE `tb_piutang`.`id_user` = '3'
ORDER BY `tanggal_pinjam` DESC
---
    public function getPiutangUser($user_id)
    {
        return $this->db->table($this->table)
        ->join('tb_dompet', 'tb_dompet.id_dompet=tb_piutang.id_dompet')
        ->where('tb_piutang.id_user', $user_id)
        ->orderBy('tanggal_pinjam', 'DESC')
        ->get()
        ->getResultArray();