app/Models/RencanaModel.php

    public function getRencana($id = false)
    {
        if ($id == false) {
            return $this->findAll();
---
SELECT *
FROM `tb_rencana`

    public function getRencanaUser($user_id)
    {
        return $this->db->table($this->table)
        ->where('id_user', $user_id)
        ->orderBy('id', 'DESC')
        ->get()
        ->getResultArray();
---
SELECT *
FROM `tb_rencana`
WHERE `id_user` = '3'