app/Models/TargetModel.php

    public function getLimitTarget()
    {
        return $this->db->table($this->table)
            ->limit(4)
            ->get()
            ->getResultArray();
---
SELECT *
FROM `tb_target`
 LIMIT 4