app/Models/TargetModel.php

SELECT *
FROM `tb_target`
WHERE `id_user` = '3'
 LIMIT 4
---
    public function getLimitTarget($user_id)
    {
        return $this->db->table($this->table)
            ->where('id_user', $user_id)
            ->limit(4)
            ->get()
            ->getResultArray();