app/Models/TodolistModel.php

SELECT *
FROM `tb_todolist`
---
    public function getToDo($slug = false)
    {
        if ($slug == false) {
            return $this->findAll();

SELECT *
FROM `tb_todolist`
WHERE `id_user` = '3'
---
    public function getToDoUser($user_id)
    {
        return $this->db->table($this->table)
        ->where('id_user', $user_id)
        ->get()
        ->getResultArray();